<template>
  <div>
    <h2>Пример реактивности. введите имя</h2>
    <br />
    <!-- у шаблона всегда должен быть корневой элемент -->
    <input v-model="name" />
    <!-- У поля ввода в качестве переменной обмена указываем name
    при помощи директиву Vue  v-model. Все директивы Vue начинаются с "v"-->
    <span>Привет,{{name}}!</span>
    <!-- Когда нам в шаблоне нужно вывести какое-то значение перемнной заключаем 
    в двойные фигурные скобки {{перменная}}-->
  </div>
</template>
<script>
export default {
  data() {
    return {
      //переменная обмена
      name: "Неизвестный"
    };
  }
};
</script>